<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
        "http://www.w3.org/TR/html4/loose.dtd">
<html lang="de">
<head>
	<title>FinkCommander Hilfe -- Kennenlernen der Fink-Pakete</title>
	<link href="../fcstyle.css" rel="stylesheet" type="text/css">
</head>

<body>

<h2>Kennenlernen der Fink-Pakete</h2>

<p>FinkCommander offeriert Ihnen verschiedene Optionen zum besseren Kennenlernen 
der Software-Pakete, die Sie mit Fink installiert haben. Alle Kommandos werden 
auf das im Hauptfenster ausgew&auml;hlte Paket angewendet.</p>

<dl>
    <dt>Ablage:&Ouml;ffne .info/.patch Datei</dt>
    
        <dd><p>Auch aufrufbar durch Doppelklick oder Drag&amp;Drop der ausgew&auml;hlten Pakete.</p>

        <p>&Ouml;ffnet die Dateien, welche Fink braucht um Pakete von Source zu installieren. Mit 
        Drag&amp;Drop k&ouml;nnen diese Dateien auch in den Finder oder auf den Schreibtisch kopiert 
        werden.</p></dd>

	<dt>Werkzeuge:Paketinhalt zeigen</dt>

		<dd><p>Auch enthalten in: Kontextmen&uuml; der Pakettabelle, Werkzeugliste.</p>
		
		<p>&Ouml;ffnet ein dem Finder &auml;hnliches Fenster, welches die mit Fink installierten 
                Dateien f&uuml;r das ausgew&auml;hlte Paket anzeigt. Mit diesem Kommando k&ouml;nnen Sie mehrere 
                Fenster &ouml;ffnen, jedoch nur eine Paketauswahl ber&uuml;cksichtigen.</p>
		
		<p>Die Symbole in der oberen linken Ecke erlauben das Umschalten zwischen 
                Listen- und Spaltenansicht. Im Fenster angezeigte Dateien k&ouml;nnen mit 
                <kbd>Ablage:&Ouml;ffne ausgew&auml;hlte Datei(en)</kbd> oder per Doppelklick ge&ouml;ffnet 
                werden. Mit Drag&amp;Drop k&ouml;nnen die Dateien auch in den Finder kopiert werden, in 
                der browser view m&uuml;ssen Sie dazu allerdings die Auswahl-Taste gedr&uuml;ckt halten.</p>
		
		<p>Das Verwenden der Spaltenansicht kann zum Anzeigen gr&ouml;sserer Pakete einigen 
                Speicherplatz beanspruchen, der erst beim Schliessen des Fensters wieder frei 
                gegeben wird. Die Listenansicht braucht im Gegensatz merkbar weniger Speicher, daher
                ist sie auch als Grundeinstellung gew&auml;hlt worden.</p></dd>

    <dt>Werkzeuge:Paket Dokumentation zeigen</dt>
        
        <dd><p>Auch enthalten in: Kontextmen&uuml;.</p>
        
        <p>&Ouml;ffnet den mit Fink installierten Ordner, welcher die Paket Dokumantation enth&auml;lt, 
        in einem Finder Fenster .</p></dd>
        
    <dt>Werkzeuge:Paket-Inspektor zeigen</dt>
    
        <dd><p id="info">Auch enthalten in: Kontextmen&uuml;, Werkzeugliste.</p>
        
        <p>&Ouml;ffnet ein Fenster mit der Beschreibung der ausgew&auml;hlten Pakete. Diese Kurzbeschreibung 
        enth&auml;lt Links zu den Paket-Websites und die Email-Adresse des Maintainers.</p></dd>

</dl>


</body>
</html>
