Repository: danielj7/finkcommander
Catalog: *.lproj/Preferences.strings
Languages: de, fr, ja

# 5.title
source: FinkCommander Preferences
de: FinkCommander Einstellungen
fr: Préférences de FinkCommander
ja: FinkCommander 環境設定

# 11.label
source: Commander
ja: コマンド

# 242.label
source: Download
fr: Télécharger
ja: ダウンロード

# 248.label
source: Paths
de: Verzeichnisse
fr: Chemins
ja: パス

# 252.label
source: Display
de: Darstellung
fr: Affichage
ja: 表示

# 346.title
source: Use default (/sw)
de: Standardverzeichnis (/sw) verwenden
fr: Utiliser le défaut (/sw)
ja: デフォルト (/sw) を使う

# 347.title
source: Use this path:
de: Dieses Verzeichnis verwenden:
fr: Utiliser ce chemin:
ja: このパスを使う:

# 455.label
source: Environment
de: Umgebung
fr: Environnement
ja: 環境

# 457.headerCell.title
source: Value
de: Wert
fr: Valeur
ja: 値

# 459.headerCell.title
source: Key
de: Name
fr: Clé
ja: キー

# 532.title
source: None
de: Keiner
fr: Aucune
ja: なし

# 534.title
source: High
de: Hoch
fr: Haute
ja: 全部

# 604.label
source: Software Update
ja: ソフトウェア・アップデート

# 100047.title
source: Cancel
de: Abbrechen
fr: Annuler
ja: キャンセル

# 100120.title
source: Use unstable packages
de: Pakete aus Unstable verwenden
fr: Utiliser les packages unstable
ja: 不安定版(unstable)パッケージを使う

# 100123.title
source: Use unstable cryptography packages*
de: Crypto-Pakete aus Unstable verwenden*
fr: Utiliser les packages unstables cryptographiques*
ja: 暗号化技術を含むパッケージを使う*

# 100138.title
source: Change configuration settings in the fink.conf file: fink.conf file:
de: Einstellungen in fink.conf verändern: fink.conf file:
fr: Changer la configuration dans le fichier fink.conf: fichier fink.conf:
ja: fink.conf ファイルにある環境設定を変更する: fink.conf file:

# 100177.title
source: Apply
de: Anwenden
fr: Appliquer
ja: 適用

# 100190.title
source: Running Commands:
de: Befehle:
fr: Commandes en cours d'exécution:
ja: コマンド実行: :

# 100192.title
source: Keep the build directory after installation
de: Das Build-Verzeichnis nach der Installation behalten
fr: Conserver le dossier de compilation après l'installation
ja: インストールのあとも build ディレクトリを残す

# 100193.title
source: Keep the root directory after installation
de: Das Root-Verzeichnis nach der Installation behalten
fr: Conserver le dossier racine après l'installation
ja: インストールのあとも root ディレクトリを残す

# 100240.title
source: *Select only if allowed by US export laws.
de: *Nur auswählen wenn U.S. Exportgesetze dies erlauben
fr: *Sélectioner seulement si les lois d'export des Etats-Unis le permettent.
ja: *アメリカ輸出法によって許可されている場合だけ選択してください

# 100256.title
source: Automatically expand and collapse output
de: Ausgabe automatisch auf- und zuklappen
fr: Étendre et réduire automatiquement la sortie
ja: 自動で出力を開いたり閉じたりする

# 100266.title
source: Browse…
de: Auswählen…
fr: Rechercher…
ja: ブラウズ…

# 100267.title
source: Use this HTTP proxy when downloading:
de: Diesen HTTP Proxy beim Download verwenden:
fr: Utiliser ce proxy HTTP lors du téléchargement:
ja: ダウンロードにこの HTTP プロキシを使う:

# 100268.title
source: Look for downloads in this directory:
de: In diesem Verzeichnis nach Downloads suchen:
fr: Regarder pour des téléchargements dans ce dossier:
ja: このディレクトリにダウンロードを探しに行く:

# 100272.title
source: Use this FTP proxy when downloading:
de: Diesen FTP Proxy beim Download verwenden:
fr: Utiliser ce proxy FTP lors du téléchargement:
ja: ダウンロードにこの FTP プロキシを使う:

# 100290.title
source: Acquire root privileges with:
de: root Berechtigung erlangen mit:
fr: Acquérir les privilèges root avec:
ja: root 権限取得に使うコマンド:

# 100294.title
source: Change configuration settings in the fink.conf file: fink.conf file:
fr: Changer la configuration dans le fichier fink.conf: fichier fink.conf:
ja: fink.conf ファイルにある設定を変える: 設定を変える: fink.conf file:

# 100326.title
source: Use passive mode FTP
de: FTP im Passiv-Modus benutzen
fr: Utiliser FTP en mode passif
ja: FTP のパッシブモードを使う

# 100354.title
source: Browse…
de: Auswählen…
fr: Rechercher…
ja: ブラウズ…

# 100355.title
source: Path to fink files:
de: Verzeichnis für fink:
fr: Chemin des fichiers fink:
ja: fink ファイルのパス:

# 100358.title
source: Browse…
de: Auswählen…
fr: Rechercher…
ja: ブラウズ…

# 100367.title
source: Save output logs here:
de: Inhalt des Ausgabe-Fensters in diesem Verzeichnis sichern:
fr: Sauver les journaux des sorties ici:
ja: 出力のログをここに保存する:

# 100399.title
source: Give FinkCommander credit in emails
de: FinkCommander in E-mails erwähnen
fr: Créditer FinkCommander dans les courriels
ja: メールで FinkCommander に動作報告を送る

# 100401.title
source: Feedback:
de: Kommunikation mit Maintainer:
ja: フィードバック: :

# 100419.title
source: Always choose the default response to prompts
de: Bei Fragen immer Vorschlag von Fink als Antwort verwenden
fr: Toujours choisir la réponse par défaut aux questions
ja: 入力を求められたら常にデフォルトの選択肢を選ぶ

# 100421.title
source: Warn me before removing a package
de: Warnen bevor ein Befehl beendet wird
fr: Warn me before terminating a command
ja: パッケージの削除の前に警告する

# 100424.title
source: Show the number of packages in the window title
de: Anzahl Pakete im Fenstertitel anzeigen
fr: Afficher le nombre de paquetages dans la fenêtre de titre
ja: ウィンドウタイトルにパッケージ数を表示する

# 100433.title
source: Limit output scrollback to
de: Puffergrösse auf
fr: Limiter la taille de la sortie à
ja: 出力のスクロールバックを

# 100435.title
source: lines
de: Zeilen begrenzen
fr: lignes
ja: 行に制限する

# 100441.title
source: Scroll to the bottom when input is received
de: Ans Ende springen wenn neue Ausgabe empfangen wird
fr: Scroller jusqu'en bas lorsqu'une entrée est reçue
ja: 出力があったときはいつでも一番下までスクロールする

# 100445.title
source: Output:
de: Ausgabe-Fenster:
fr: Sortie:
ja: 出力:

# 100447.title
source: Scroll to the last selection after sorting the table
de: Zuletzt ausgewählte Zeile nach Sortierung anzeigen
fr: Scroller jusqu'à la dernière sélection après avoir trié la table
ja: 表をソートしたあと最後に選択していた場所にスクロール

# 100448.title
source: Table:
de: Paketdaten:
ja: 表: :

# 100461.title
source: Environment Settings:
de: Umgebung bestimmen:
fr: Régalges d'Environnement:
ja: 環境変数 :

# 100462.title
source: Name:
fr: Nom:
ja: 名前:

# 100463.title
source: Value:
de: Wert:
fr: Valeur:
ja: 値: ::

# 100466.title
source: Delete
de: Entfernen
fr: Effacer
ja: 削除

# 100467.title
source: Add
de: Hinzufügen
fr: Ajouter
ja: 追加

# 100494.title
source: Download with:
de: Download mit:
fr: Télécharger avec:
ja: ダウンロードに使うコマンド:

# 100496.title
source: Restore
de: Wiederherstellen
fr: Restaurer
ja: もどす

# 100535.title
source: Verbosity:
de: Detailgrad:
fr: Verbosité:
ja: 詳細: :

# 100551.title
source: Show redundant unstable package versions
fr: Afficher les versions redondantes des paquetages unstable
ja: 重複している不安定版のバージョンも表示

# 100557.title
source: This change will take effect the next time the table is updated.
ja: この変更は次に表が更新されたときに有効になります

# 100558.title
source: This change will take effect the next time the table is updated.
fr: Ce changement prendra effet la prochaine fois que la table sera mise à jour.
ja: この変更は次の表が更新されたときに有効になります

# 100573.title
source: Window Title:
ja: ウィンドウタイトル: :

# 100574.title
source: Warn me before terminating a command
de: Fenstertitel:
ja: コマンドの中止の前に警告する

# 100577.title
source: Browse...
ja: ブラウズ...

# 100578.title
source: Path to perl:
ja: Perl のパス:

# 100591.title
source: Support regular expressions in filter
ja: フィルタで正規表現をサポートする

# 100612.title
source: Software Update checks for new and updated versions of FinkCommander.
ja: ソフトウェア・アップデートで FinkCommander の新しいバージョンを調べられます。

# 100614.title
source: Automatically check for updates
ja: 更新を自動的に調べる

# 100615.title
source: Check Now
ja: いますぐ更新

# 120.ibShadowedToolTip
source: Help Fink by testing the latest Unix software
fr: Aide Fink en testant les derniers logiciels Unix

# 256.ibShadowedToolTip
source: Hides the output, except when you really need it
fr: Cache la sortie, sauf quand vous en avez vraiment besoin

# 267.ibShadowedToolTip
source: Allows use of apt-get from behind a firewall
fr: Permet l'utilisation de apt-get derrière un pare-feu

# 272.ibShadowedToolTip
source: Allows use of apt-get from behind a firewall
fr: Permet l'utilisation de apt-get derrière un pare-feu

# 345.ibShadowedToolTip
source: Sets path to fink files. Use this only if FinkCommander could not find the path.
de: Sie brauchen das Verzeichnis hier zu bezeichnen nur wenn FinkCommander es nicht finden könnte
fr: Règle le chemin des fichiers fink. N'utiliser que si FinkCommander n'a pu trouver le chemin.

# 399.ibShadowedToolTip
source: Come on; it's just one more line
fr: Allez; c'est juste une ligne en plus

# 419.ibShadowedToolTip
source: Let fink decide
fr: Laisse fink décider

# 433.ibShadowedToolTip
source: Limit the memory used by the output view
fr: Limite la mémoire utilisée par la sortie

# 441.ibShadowedToolTip
source: Jump to the end for new input no matter where you have scrolled to
fr: Saute à la fin pour une entrée n'importe où que vous ayez scrollé

# 447.ibShadowedToolTip
source: The way Mail does it
fr: Comme Mail le fait

# 496.ibShadowedToolTip
source: Restore to default settings
de: Standardeinstellungen
fr: Restaure les réglages par défaut

# 551.ibShadowedToolTip
source: Show unstable version even when identical to stable
fr: Affiche la version unstable même quand identique à la stable
