<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN"
        "http://www.w3.org/MarkUp/Wilbur/HTML32.dtd">
<html lang="de">
<head>
	<title>W&uuml;rdigungen</title>
</head>

<body>

<p>F&uuml;r den Text der Gnu Public License siehe Hilfe:FinkCommander Hilfe:Lizenz</p>

<center>
<h3>Entwickler-Team</h3>
</center>

<ul>
	<li><p>Steve Burr -- Projekt Administrator</p></li>
	<li><p>Ben Hines -- Entwickler</p></li>
	<li><p>Sylvain Cuaz -- Franz&ouml;sische &Uuml;bersetzung</p></li>
	<li><p>Mathias Meyer -- Deutsche &Uuml;bersetzung</p></li>
	<li><p>Patrick NŠf -- Deutsche &Uuml;bersetzung</p></li>
</ul>

<center>
<<<<<<< Credits.html
<h3>Anerkennungen</h3> 
=======
<h3>Anerkennungen</h3>
>>>>>>> 1.2
</center>

<p>Das FinkCommander Entwickler-Team m&ouml;chte seinen Dank an folgende Personen aussprechen:</p>

<ul>
	<li><p>Zuallererst Christoph Pfisterer f&uuml;r die Erfindung von fink, ohne das FinkCommander nichts als eine leere Tabelle und ein Haufen nutzloser Men&uuml;s und Schaltfl&auml;chen w&auml;re.</p></li>

	<li><p>Max Horn und David Morrison daf&uuml;r, dass sie nach dem Weggang von Christoph die Projektadministration so f&auml;hig weitergef&uuml;hrt haben.</p></li>

	<li><p>Justin Hallett, Dave Vasilevsky und Brian Lenihan, die beim Debuggen der Probleme halfen, die FinkCommander mit Vorab-Versionen von Jaguar hatte. Ebenfalls hilfreich waren ihre Hinweise und Vorschl&auml;ge zu zahlreichen anderen Teilen von FinkCommander.</p></li>

	<li><p>Martin Costabel, der den Hinweis lieferte, wie die verf&uuml;gbaren Pakete der bin&auml;ren Distribution von fink ermittelt werden k&ouml;nnen.</p></li>
	
	<li><p>Dem restlichen fink Entwickler-Team daf&uuml;r, dass sie Mac-Benutzern all diese grossartige Unix Software so einfach verf&uuml;gbar gemacht haben.</p></li>
</ul>

<center>
<h3>Referenzen</h3>
</center>

<p>Die folgenden Ressourcen waren &auml;usserst hilfreich bei der Entwicklung von FinkCommander und werden sehr empfohlen:</p>

<ul>
	<li><p>Das Buch <a href="http://www.bignerdranch.com/Book/">Cocoa Programming for Mac OS X</a> von Aaron Hillegass.  Es ist eine &uuml;berragende Einf&uuml;hrung in Cocoa.</p></li>
	
	<li><p>Mike Beam's <a href="http://www.macdevcenter.com/pub/ct/37">Cocoa tutorials</a>, speziell die Tutorials &uuml;ber Werkzeugleisten und wie man Tabellenspalten anpasst, bei denen sich FinkCommander stark bedient.</p></li>
		
	<li><p>Die <a href="http://www.cocoadevcentral.com/">Cocoa Dev Central Web Site</a>, eine weitere sehr gute Quelle f&uuml;r Tutorials.</p></li>

	<li><p>Die Open Source Code- und Programmier-Tips zu <a href="http://homepage.mac.com/hoshi_takanori/cocoa-browser/">Cocoa Browser</a> von Hoshi Takanori und Max Horn. FinkCommander verwendet die "MyTextView" Klasse von Cocoa Browser, um das Hand-Symbol &uuml;ber den Links im Paket-Inspektor erscheinen zu lassen.</p></li>
</ul>


</body>
</html>
